Vulnerability Test Results/artillery-load-test.yml
config:
  target: "https://vitalcore.vercel.app"
  phases:
    - name: "Warm Up"
      duration: 30
      arrivalRate: 5
    - name: "Baseline Load (100 users)"
      duration: 60
      arrivalRate: 100
    - name: "Ramp to Stress (200 users)"
      duration: 60
      arrivalRate: 200
    - name: "Peak Stress (500 users)"
      duration: 60
      arrivalRate: 500
    - name: "Spike (50 to 500)"
      duration: 30
      arrivalRate: 50
    - name: "Spike Peak"
      duration: 30
      arrivalRate: 500
    - name: "Recovery"
      duration: 30
      arrivalRate: 50
    - name: "Endurance"
      duration: 1800
      arrivalRate: 100
  variables:
    jwtToken: "{{ $env.JWT_TOKEN }}"
  defaults:
    headers:
      Content-Type: "application/json"
      Authorization: "Bearer {{ jwtToken }}"
  ensure:
    p95: 5000
    maxErrorRate: 20

scenarios:
  # ── AI Coach Test ─────────────────────────────────────────────────────────
  - name: "AI Coach API - Normal Load"
    weight: 60
    flow:
      - post:
          url: "/api/ai-coach"
          json:
            message: "What should I eat before my workout today?"
            history:
              - id: "msg-1"
                sender: "user"
                text: "Help me track my macros"
              - id: "msg-2"
                sender: "ai"
                text: "Sure! Your calorie target is 2200 kcal."
            metrics:
              caloriesBurned: 320
              caloriesConsumed: 1650
              hydrationMl: 1800
              steps: 5400
              sleepHours: 7.0
              sleepQuality: 70
              stressLevel: 35
              recoveryPercentage: 80
              fatigueScore: 25
              caloriesTarget: 600
              hydrationTarget: 2500
              stepsTarget: 10000
              sleepTarget: 8.0
          expect:
            - statusCode: [200, 429]
            - hasProperty: "reply"
          capture:
            - json: "$.reply"
              as: "aiReply"

  # ── Future Lab Test ──────────────────────────────────────────────────────
  - name: "Future Health Lab API - Normal Load"
    weight: 30
    flow:
      - get:
          url: "/api/future-lab"
          expect:
            - statusCode: 200
            - hasProperty: "healthScore"
            - hasProperty: "riskScores"

  # ── Auth Security Tests ──────────────────────────────────────────────────
  - name: "Auth Validation Tests"
    weight: 10
    flow:
      # No auth token - should 401
      - post:
          url: "/api/ai-coach"
          headers:
            Content-Type: "application/json"
            Authorization: ""
          json:
            message: "test"
          expect:
            - statusCode: 401

      # Invalid JWT - should 401
      - post:
          url: "/api/ai-coach"
          headers:
            Content-Type: "application/json"
            Authorization: "Bearer eyJhbGciOiJIUzI1NiJ9.invalid.payload"
          json:
            message: "test"
          expect:
            - statusCode: 401

      # Oversized payload - should 413
      - post:
          url: "/api/ai-coach"
          headers:
            Content-Type: "application/json"
            Authorization: "Bearer {{ jwtToken }}"
          json:
            message: "{{ 'A'.repeat(2000000) }}"
          expect:
            - statusCode: [400, 413]

plugins:
  metrics-by-endpoint: {}
  publish-metrics:
    - type: statsd
      host: localhost
      port: 8125
      prefix: "vitalcore."
