Vulnerability Test Results/artillery-load-test.yml
config:
  target: "{{ $processEnvironment.TARGET_URL || 'http://localhost:3000' }}"
  phases:
    # 1. Warm-up Phase
    - duration: 30
      arrivalRate: 10
      name: "Warm-up Phase"
    
    # 2. Baseline Load: 100 concurrent arrivals / sec for 60s
    - duration: 60
      arrivalRate: 100
      name: "Baseline Load Test (100 req/s)"
    
    # 3. Stress Ramp-up Phase: 100 to 500 arrivals / sec
    - duration: 90
      arrivalRate: 100
      rampTo: 500
      name: "Stress Test Ramp-up"

    # 4. Spike Burst Phase: Sudden spike to 500 arrivals / sec
    - duration: 30
      arrivalRate: 500
      name: "Spike Surge Phase"

  defaults:
    headers:
      Content-Type: "application/json"
      Authorization: "Bearer {{ $processEnvironment.AUTH_TOKEN || 'eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.dummy_token' }}"

  plugins:
    expect: {}

scenarios:
  - name: "Health Telemetry & AI Coaching Workflow"
    flow:
      # Step 1: Submit Contact Inquiry (Public Edge API)
      - post:
          url: "/api/contact"
          json:
            name: "Performance Benchmark Bot"
            email: "perf-test@vitalcore.ai"
            message: "Automated performance load validation query"
          capture:
            - json: "$.success"
              as: "contactSuccess"
          expect:
            - statusCode:
                - 200
                - 429

      - think: 1

      # Step 2: Post to AI Coach (Protected Rate-Limited API)
      - post:
          url: "/api/ai-coach"
          json:
            message: "Generate daily preventive workout plan based on current recovery"
            metrics:
              caloriesBurned: 520
              caloriesConsumed: 2100
              hydrationMl: 2800
              steps: 10200
              sleepHours: 8.2
              sleepQuality: 92
              recoveryPercentage: 85
          expect:
            - statusCode:
                - 200
                - 429

      - think: 1

      # Step 3: Fetch Future Lab Digital Twin Forecast
      - get:
          url: "/api/future-lab"
          expect:
            - statusCode:
                - 200
                - 401
